docs: 그래프 아키텍쳐 수정
